**1**. (25 points)

- Write a **recursive** function that returns the length of the hailstone sequence staring with a positive integer $n$.  (15 points)

The hailstone sequence is defined by the following rules:
```
- If n is 1, stop
- If n is even, divide by 2 and repeat
- If n is odd, multiply by 3 and add 1 and repeat
```
For example, the hailstone sequence starting with $n = 3$ has length 8:
```
- 3, 10, 5, 16, 8, 4, 2, 1
```

Use the `functools` package to avoid duplicate function calls.

- Find the number that gives the longest sequence for starting numbers less than 100,000. Report the number and the length of the generated sequence. (10 points)

In [1]:
from functools import lru_cache

In [2]:
@lru_cache(None)
def hailstone(n, k=1):
    """Reprots length of hailstone (Collatz) sequence startign with n."""
    if n == 1:
        return k
    else:
        if n % 2 == 0:
            return hailstone(n // 2, k+1)
        else:
            return hailstone(n*3 + 1, k+1)

In [3]:
best = [0, 0]
for i in range(1, 100000):
    s = hailstone(i)
    if s > best[1]:
        best = (i, s)

In [4]:
best

(77031, 351)

An alternative solution.

In [5]:
@lru_cache(None)
def hailstone_alt(n):
    """Reprots length of hailstone (Collatz) sequence startign with n."""
    if n == 1:
        return 1
    else:
        if n % 2 == 0:
            return 1 + hailstone_alt(n // 2)
        else:
            return 1 + hailstone_alt(n*3 + 1)

In [6]:
hailstone_alt(3)

8

In [7]:
best = [0, 0]
for i in range(1, 100000):
    s = hailstone_alt(i)
    if s > best[1]:
        best = (i, s)

In [8]:
best

(77031, 351)

**2**. (25 points)

- Create a `pnadas` DataFrame called `df` from the data set at https://bit.ly/2ksKr8f, taking care to only read in the `time` and `value` columns. (5 points)
- Fill all rows with missing values with the value from the last non-missing value (i.e. forward fill) (5 points)
- Convert to a `pandas` Series `s` using `time` as the index (5 points)
- Create a new series `s1` with the rolling average using a shifting window of size 7 and a minimum period of 1 (5 points)
- Report the `time` and value for the largest rolling average (5 points)

In [9]:
import pandas as pd

In [10]:
df = pd.read_csv('https://bit.ly/2ksKr8f', usecols=['time', 'value'])

In [11]:
df = df.fillna(method='ffill')

In [12]:
df.head()

   time   value
0     1  306.25
1     2  299.50
2     3  303.45
3     4  296.75
4     5  304.40

Note: The pd.Series constructor has quite unintuitive behavior when the `index` argument is provided. See  `DataFrame_to_Series.ipynb` for this.

In [13]:
s = pd.Series(data=df['value'])
s.index = df['time']

In [14]:
s.head()

time
1    306.25
2    299.50
3    303.45
4    296.75
5    304.40
Name: value, dtype: float64

In [15]:
s1 = s.rolling(7, 1).mean()

In [16]:
s1.head()

time
1    306.250000
2    302.875000
3    303.066667
4    301.487500
5    302.070000
Name: value, dtype: float64

In [17]:
s1.sort_values(ascending=False).head(1)

time
772    505.15
Name: value, dtype: float64

**3**. (25 points)

- Get information in JSON format about startship 23 from the Star Wars API https://swapi.co/api using the `requests` package (5 points)
- Report the time interval between `created` and `edited` in minutes using the `pendulum` package (5 points)
- Replace the URL values stored at the `films` key with the titles of the actual films (5 points)
- Save the new JSON (with film titles and not URLs) to a file `ship.json` (5 points)
- Read in the JSON file you have just saved as a Python dictionary (5 points)

In [18]:
import requests

In [19]:
url = 'https://swapi.co/api/starships/23'
ship = requests.get(url).json()
ship

{'name': 'EF76 Nebulon-B escort frigate',
 'model': 'EF76 Nebulon-B escort frigate',
 'manufacturer': 'Kuat Drive Yards',
 'cost_in_credits': '8500000',
 'length': '300',
 'max_atmosphering_speed': '800',
 'crew': '854',
 'passengers': '75',
 'cargo_capacity': '6000000',
 'consumables': '2 years',
 'hyperdrive_rating': '2.0',
 'MGLT': '40',
 'starship_class': 'Escort ship',
 'pilots': [],
 'films': ['https://swapi.co/api/films/2/', 'https://swapi.co/api/films/3/'],
 'created': '2014-12-15T13:06:30.813000Z',
 'edited': '2014-12-22T17:35:44.848329Z',
 'url': 'https://swapi.co/api/starships/23/'}

In [20]:
import pendulum

In [21]:
created = pendulum.parse(ship['created'])

In [22]:
edited = pendulum.parse(ship['edited'])

In [23]:
(edited - created).in_minutes()

10349

In [24]:
films = [requests.get(film).json()['title'] for film in ship['films']]

In [25]:
films

['The Empire Strikes Back', 'Return of the Jedi']

In [26]:
ship['films'] = films

In [27]:
import json

In [28]:
with open('ship.json', 'w') as f:
    json.dump(ship, f)

In [29]:
with open('ship.json') as f:
    ship = json.load(f)

In [30]:
ship

{'name': 'EF76 Nebulon-B escort frigate',
 'model': 'EF76 Nebulon-B escort frigate',
 'manufacturer': 'Kuat Drive Yards',
 'cost_in_credits': '8500000',
 'length': '300',
 'max_atmosphering_speed': '800',
 'crew': '854',
 'passengers': '75',
 'cargo_capacity': '6000000',
 'consumables': '2 years',
 'hyperdrive_rating': '2.0',
 'MGLT': '40',
 'starship_class': 'Escort ship',
 'pilots': [],
 'films': ['The Empire Strikes Back', 'Return of the Jedi'],
 'created': '2014-12-15T13:06:30.813000Z',
 'edited': '2014-12-22T17:35:44.848329Z',
 'url': 'https://swapi.co/api/starships/23/'}

**4**. (25 points)

Use SQL to answer the following questions using the SQLite3 database `anemia.db`:

- Count the number of male and female patients (5 points)
- Find the average age of male and female patients (as of right now) (5 points)
- Show the sex, hb and name of patients with severe anemia ordered by severity. Severe anemia is defined as
    - Hb < 7 if female
    - Hb < 8 if male
    
(15 points)

You many assume `pid` is the PRIMARY KEY in the patients table and the FOREIGN KEY in the labs table. 
   
Note: Hb is short for hemoglobin levels.

Hint: In SQLite3, you can use `DATE('now')` to get today's date.

In [31]:
%load_ext sql

In [32]:
%sql sqlite:///anemia.db

'Connected: @anemia.db'

In [33]:
%%sql 

SELECT * FROM sqlite_master WHERe type='table'

 * sqlite:///anemia.db
Done.

[('table', 'labs', 'labs', 2, 'CREATE TABLE labs (\n\t"index" BIGINT, \n\tlab_id BIGINT, \n\thb FLOAT, \n\tpid TEXT\n)'),
 ('table', 'patients', 'patients', 15, 'CREATE TABLE patients (\n\t"index" BIGINT, \n\tpid TEXT, \n\tname TEXT, \n\tsex TEXT, \n\tbirthday DATE\n)')]

In [34]:
%%sql

SELECT * FROM patients LIMIT 3

 * sqlite:///anemia.db
Done.

[(0, '535-21-0780', 'Jeffrey Lowe', 'M', '2005-08-15'),
 (1, '400-64-2928', 'Heather Fields MD', 'F', '1966-12-29'),
 (2, '018-92-0541', 'James Lloyd', 'M', '1959-08-28')]

In [35]:
%%sql

SELECT * FROM labs LIMIT 3

 * sqlite:///anemia.db
Done.

[(0, 712, 16.9, '827-62-3031'),
 (1, 183, 12.7, '309-27-7072'),
 (2, 549, 18.1, '382-63-3837')]

In [36]:
%%sql

SELECT sex, COUNT(sex)
FROM patients
GROUP BY sex

 * sqlite:///anemia.db
Done.

[('F', 523), ('M', 477)]

In [37]:
%%sql

SELECT date('now')

 * sqlite:///anemia.db
Done.

[('2019-10-02',)]

In [38]:
%%sql

SELECT sex, round(AVG(date('now') - birthday), 1)
FROM patients
GROUP BY sex

 * sqlite:///anemia.db
Done.

[('F', 58.7), ('M', 57.8)]

In [39]:
%%sql

SELECT sex, hb, name
FROM patients, labs
WHERE patients.pid = labs.pid AND 
((sex = 'M' AND hb < 8) OR (sex = 'F' AND hb < 7))
ORDER BY hb

 * sqlite:///anemia.db
Done.

[('M', 3.8, 'Eric Lee'),
 ('M', 4.6, 'Brian Coleman'),
 ('M', 5.9, 'Shawn Curry'),
 ('F', 6.3, 'Michelle Ross'),
 ('F', 6.4, 'Sharon Turner'),
 ('M', 6.4, 'Richard Moore'),
 ('M', 6.5, 'Mr. James Kennedy'),
 ('F', 6.5, 'Lorraine Ford'),
 ('M', 6.6, 'Ernest Vega'),
 ('M', 7.1, 'Ryan Wood'),
 ('M', 7.5, 'Charles Weber'),
 ('M', 7.7, 'Charles Simmons'),
 ('M', 7.8, 'Casey Nichols'),
 ('M', 7.9, 'Cory Cantrell')]